{
  "Why React?": "React क्यों?",
  "React is a JavaScript-based UI development library. Facebook and an open-source developer community run it. Although React is a library rather than a language, it is widely used in web development. The library first appeared in May 2013 and is now one of the most commonly used frontend libraries for web development.": "React एक JavaScript आधारित UI विकास पुस्तकालय है। इसे Facebook और एक ओपन स्रोत डेवलपर समुदाय चलाता है। यद्यपि React एक पुस्तकालय है और एक भाषा नहीं है, लेकिन यह वेब विकास में व्यापक रूप से प्रयोग होता है। यह पुस्तकालय मई 2013 में पहली बार आयी थी और अब वेब विकास के लिए सबसे आमतौर पर प्रयोग होने वाली फ्रंटएंड पुस्तकालयों में से एक है।",
  "ReactJs Keys": "ReactJs कुंजी",
  "After answering what is ReactJs, let us know what keys are.": "ReactJs क्या है इसका उत्तर देने के बाद, आइए जानें की कुंजीयें क्या होती हैं।",
  "While dealing with components that are rendered dynamically in React, keys are essential. When a key value is set, it helps React identify each component uniquely, even after modifications. Keys assist React in determining which elements have changed, been removed, or been added.": "React में डाइनेमिक रूप से रेंडर किए जाने वाले कॉम्पोनेंट्स के साथ काम करते समय, कुंजीयें आवश्यक होती हैं। जब कुंजी मान निर्धारित की जाती है, तो यह रिअैक्ट को परिवर्तनों के बाद भी प्रत्येक कॉम्पोनेंट को अद्वितीय रूप से पहचानने में मदतुलचाने में मदद करती है। कुंजीयें रिअैक्ट को बताने में सहायता करती हैं कि कौन से तत्व परिवर्तित हुए हैं, हटाए गए हैं या जोड़े गए हैं।",
  "When creating lists of components in React, it is necessary to use a special attribute called 'key'. React uses keys to track and identify which list items have been modified, removed, or added. In other words, keys are used to uniquely identify components within lists.": "React में कॉम्पोनेंट्स की सूचियों को बनाते समय, एक विशेष गुणांक 'key' का प्रयोग करना आवश्यक होता है। रिअैक्ट कुंजीयें प्रयोग करता है ताकि पता चल सके कि कौन से सूची आइटमों में परिवर्तन हुए हैं, हटाए गए हैं या जोड़े गए हैं। दूसरे शब्दों में कहें तो, कुंजीयें सूचियों के भीतर कॉम्पोनेंट्स को अद्वितीय रूप से पहचानने के लिए प्रयोग होती हैं।"
}
